In [1]:
# Pandas Series: it can hold differenct data types
    series = pd.Series(data = list|array|dict, index=list|array|dict)

# pandas Series use indices efficiently, making it like a hash table or a dictionary
# Normally operations are based on series indices

# panda DataFrame
    df.info()
    df.describe()

# Selections
# For columns, use square brackets directly
    df['new'] = df['W'] + df['Z']
# For rows, use loc() or iloc() for label or position based 
    df.loc['A']; df.iloc[2]
# Select a block
    df.loc['A', 'X']
    df.loc[['A', 'B'], ['W', 'Y']]
# Conditional Selection
    df[df>0]
    df[df['W']>0]
# Multiple Conditions: () & () etc

# multilevel index

# Missing Data
    df.dropna(axis=1, thres=2)  # drop the rows with pd.nan
    df1['A'].fillna(df1['A'].mean())
# Group
    df.groupby('column_name').aggfunc()  # sum(), std(), min(), max(), mean()

# Merging, Joining, and Concatenating
# Concatenating on axis
# merge like SQL join
# Join is merge on index instead of some keys
    pd.merge(left, right, how='inner', on='key')

# Operations
    df.columns; df.index

    df['column'].unique()   # returns a numpy array
    df['column'].nunique()
    df['column'].value_counts()
    
    df.apply(...) or df['column'].apply(...)

    df.sort_values(by='column')
    df.isnull()

# pivot table
    df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

In [ ]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 100, 'b': 200, 'c': 300}

In [11]:
pd.Series(data = my_data, index = d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data = d)

a    100
b    200
c    300
dtype: int64

In [15]:
# pandas Series use labels efficiently, making it like a hash table or a dictionary
ser1 = pd.Series(data = [1, 2, 3, 4], index=['USA', 'Germany', 'USSR', 'Japan'])
ser2 = pd.Series(data = [1, 2, 5, 4], index=['USA', 'Germany', 'Italy', 'Japan'])
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [16]:
from numpy.random import randn
np.random.seed(101)

In [21]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  0.386030  2.084019 -0.376519  0.230336
B  0.681209  1.035125 -0.031160  1.939932
C -1.005187 -0.741790  0.187125 -0.732845
D -1.382920  1.482495  0.961458 -2.141212
E  0.992573  1.192241 -1.046780  1.292765

In [24]:
df[['W', 'Z']]

          W         Z
A  0.386030  0.230336
B  0.681209  1.939932
C -1.005187 -0.732845
D -1.382920 -2.141212
E  0.992573  1.292765

In [25]:
df['new'] = df['W'] + df['Z']

In [26]:
df

          W         X         Y         Z       new
A  0.386030  2.084019 -0.376519  0.230336  0.616367
B  0.681209  1.035125 -0.031160  1.939932  2.621142
C -1.005187 -0.741790  0.187125 -0.732845 -1.738032
D -1.382920  1.482495  0.961458 -2.141212 -3.524132
E  0.992573  1.192241 -1.046780  1.292765  2.285338

In [27]:
df.shape

(5, 5)

In [28]:
df.loc['C']   # label based index

W     -1.005187
X     -0.741790
Y      0.187125
Z     -0.732845
new   -1.738032
Name: C, dtype: float64

In [29]:
df.iloc[3]    # position based index

W     -1.382920
X      1.482495
Y      0.961458
Z     -2.141212
new   -3.524132
Name: D, dtype: float64

In [30]:
df.loc['A', 'X']

2.084018530338962

In [33]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  0.386030 -0.376519
B  0.681209 -0.031160

In [48]:
(df['Z'] > 0) & (df['W'] > 0)

A     True
B     True
C    False
D    False
E     True
dtype: bool

In [50]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.386030  2.084019 -0.376519  0.230336
1     B  0.681209  1.035125 -0.031160  1.939932
2     C -1.005187 -0.741790  0.187125 -0.732845
3     D -1.382920  1.482495  0.961458 -2.141212
4     E  0.992573  1.192241 -1.046780  1.292765

In [52]:
df['State'] = 'CA NY NJ WA CO'.split()
df

          W         X         Y         Z State
A  0.386030  2.084019 -0.376519  0.230336    CA
B  0.681209  1.035125 -0.031160  1.939932    NY
C -1.005187 -0.741790  0.187125 -0.732845    NJ
D -1.382920  1.482495  0.961458 -2.141212    WA
E  0.992573  1.192241 -1.046780  1.292765    CO

In [56]:
df.set_index('State', inplace=True)
df

              W         X         Y         Z
State
CA     0.386030  2.084019 -0.376519  0.230336
NY     0.681209  1.035125 -0.031160  1.939932
NJ    -1.005187 -0.741790  0.187125 -0.732845
WA    -1.382920  1.482495  0.961458 -2.141212
CO     0.992573  1.192241 -1.046780  1.292765

In [59]:
# Missing data
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [10, 20, 30]}
df1 = pd.DataFrame(d)
df1

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30

In [66]:
df1.dropna(thresh=2)  # requires this many non-nan values to keep

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20

In [68]:
df1['A'].fillna(df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [70]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.065659  1.010418 -0.061175  0.117795
std    1.060611  1.058227  0.738104  1.623276
min   -1.382920 -0.741790 -1.046780 -2.141212
25%   -1.005187  1.035125 -0.376519 -0.732845
50%    0.386030  1.192241 -0.031160  0.230336
75%    0.681209  1.482495  0.187125  1.292765
max    0.992573  2.084019  0.961458  1.939932

In [72]:
# Operations
df = pd.DataFrame({
    'col1': [1, 2, 3, 4],
    'col2': [444, 555, 666, 444],
    'col3': ['abc', 'def', 'ghi', 'xyz']
})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [76]:
df['col2'].unique()

array([444, 555, 666])

In [77]:
df['col2'].nunique()

3

In [78]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [80]:
df['col2'].apply(lambda x: x *2 )

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [81]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [83]:
# Pivot table
df = pd.DataFrame({
    'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
    'B': ['one', 'one', 'two', 'two', 'one', 'one'],
    'C': ['x', 'y'] * 3,
    'D': [1, 3, 2, 5, 4, 1]
})
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [85]:
df.pivot_table(values='D', index=['A'], columns=['C'])

C      x    y
A
bar  4.0  3.0
foo  1.5  3.0